//*\\\\\\\\\\\\\\\\\\\\\\\\\завдання 1\\\\\\\\\\\\\\\\\\\\\\\\

//Створіть об'єкт "bankAccount" з властивостями "ownerName", "accountNumber", "balance".
// Додайте до об'єкту метод "deposit", який дозволяє додавати гроші на рахунок, та метод "withdraw",
// який дозволяє знімати гроші з рахунку. Методи повинні зпрацьовувати при натисканні на кнопки
// “поповнити рахунок” та отримати ‘готівку’ відповідно. Після проведення операції виводити
// повідомлення про залишок на рахунку.


// const bankAccount = {
//     ownerName: NoName,
//     accountNumber: 5,
//     balance: 6,
//     deposit() {
//     console.log("deposit");
//     },
//     withdraw() {
//     console.log("withdraw");
//     },
// }

//*\\\\\\\\\\\\\\\\\\\\\\завдання 2\\\\\\\\\\\\\\\\\\\\\\\\
//Створіть об'єкт "weather" з властивостями "temperature", "humidity", "windSpeed".
// Додайте до об'єкту метод, який повертає "true", якщо температура нижче 0 градусів Цельсія,
//  та "false", якщо температура вище або рівна 0 градусів Цельсія. Температуру потрібно отримати з
//  інпуту на сторінці. Якщо метод повернув "true" вивести повідомлення “температура нижче 0 градусів
// Цельсія” і навпаки

// const weather = {
//     temperature: 8,
//     humidity: 99,
//     windSpeed: 77
// }





//*\\\\\\\\\\\\\\\\\\\\\\завдання 3\\\\\\\\\\\\\\\\\\\\\\\\
//Створіть об’єкт "user", який буде мати властивості "name", "email", "password".
// Додайте метод "login", який буде перевіряти правильність введеного email та password.
// Використайте інпути для запису значень властивостей в об’єкт

// const user = {
//     name: 6,
//     email: 6,
//     password: 6
// }




//*\\\\\\\\\\\\\\\\\\\\\\завдання 4\\\\\\\\\\\\\\\\\\\\\\\\
//Створіть об'єкт "movie" з властивостями "title", "director", "year", "rating".
// Додайте до об'єкту метод, який повертає "true", якщо рейтинг фільму вище 8, та "false",
//  якщо рейтинг фільму 8 або нижче. Вивести значення властивостей на сторінку.
// Якщо метод повернув "true" то змінити колір тексту поля title на зелений.


// const movie = {
//     title: 6,
//     director: 9,
//     year: 0,
//     rating: 1
// }












