//*\\\\\\\\\\\\\\\\\\\\\\\\\завдання 1\\\\\\\\\\\\\\\\\\\\\\\\

//Створіть об'єкт "bankAccount" з властивостями "ownerName", "accountNumber", "balance".
// Додайте до об'єкту метод "deposit", який дозволяє додавати гроші на рахунок, та метод "withdraw",
// який дозволяє знімати гроші з рахунку. Методи повинні зпрацьовувати при натисканні на кнопки
// “поповнити рахунок” та отримати ‘готівку’ відповідно. Після проведення операції виводити
// повідомлення про залишок на рахунку.


const bankAccount = {
    ownerName: NoName,
    accountNumber: 5,
    balance: 6,
    deposit() {
    console.log("deposit");
    },
    withdraw() {
    console.log("withdraw");
    },
}

//*\\\\\\\\\\\\\\\\\\\\\\завдання 2\\\\\\\\\\\\\\\\\\\\\\\\


//*\\\\\\\\\\\\\\\\\\\\\\завдання 3\\\\\\\\\\\\\\\\\\\\\\\\


//*\\\\\\\\\\\\\\\\\\\\\\завдання 4\\\\\\\\\\\\\\\\\\\\\\\\
















